Repository: asilbek3450/quiz-js
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: A'lo (5)
ru: Отлично (5)

source: Yaxshi (4)
ru: Хорошо (4)

source: Qoniqarli (3)
ru: Удовлетворительно (3)

source: Qoniqarsiz (2)
ru: Неудовлетворительно (2)

source: Kechirasiz, bu fan va chorak uchun yetarli savollar yo'q ({} ta mavjud)
ru: К сожалению, по этому предмету и четверти недостаточно вопросов (доступно {})

source: Xush kelibsiz {}!
ru: Добро пожаловать, {}!

source: Login yoki parol noto'g'ri
ru: Неверный логин или пароль

source: Tizimdan chiqdingiz
ru: Вы вышли из системы

source: Savol muvaffaqiyatli qo'shildi va tarjima qilindi
ru: Вопрос успешно добавлен и переведен

source: Savol muvaffaqiyatli o'zgartirildi
ru: Вопрос успешно изменен

source: Savol o'chirildi
ru: Вопрос удален

source: Natija muvaffaqiyatli o'chirildi
ru: Результат успешно удален

source: {} ta natija o'chirildi
ru: {} результатов удалено

source: Xatolik yuz berdi: {}
ru: Произошла ошибка: {}

source: Fan muvaffaqiyatli qo'shildi va tarjima qilindi
ru: Предмет успешно добавлен и переведен

source: Fan muvaffaqiyatli o'zgartirildi
ru: Предмет успешно изменен

source: Bu fanga tegishli savollar yoki natijalar mavjud. Oldin ularni o'chiring.
ru: Есть вопросы или результаты, связанные с этим предметом. Сначала удалите их.

source: Fan o'chirildi
ru: Предмет удален

source: Admin Dashboard
ru: Панель администратора

source: Tizim holati va statistika
ru: Состояние системы и статистика

source: Jami Savollar
ru: Всего вопросов

source: Barcha fanlar
ru: Все предметы

source: Fanlar
ru: Предметы

source: Natijalar
ru: Результаты

source: Topshirilgan testlar
ru: Сданные тесты

source: Oxirgi Faollik
ru: Последняя активность

source: So'nggi testlar
ru: Последние тесты

source: Testlar Statistikasi
ru: Статистика тестов

source: Savollar Taqsimoti
ru: Распределение вопросов

source: Oxirgi Test Natijalari
ru: Результаты последних тестов

source: Barchasi
ru: Все

source: O'quvchi
ru: Ученик

source: Fan
ru: Предмет

source: Sinf
ru: Класс

source: Ball
ru: Балл

source: Foiz
ru: Процент

source: Sana
ru: Дата

source: Yomon
ru: Плохо

source: Hozircha natijalar mavjud emas
ru: Пока нет результатов

source: Admin Kirish
ru: Вход для администратора

source: Admin Panel
ru: Панель администратора

source: Tizimga kirish
ru: Вход в систему

source: Login
ru: Логин

source: Parol
ru: Пароль

source: Kirish
ru: Войти

source: Orqaga
ru: Назад

source: Savolni tahrirlash
ru: Редактирование вопроса

source: Yangi savol
ru: Новый вопрос

source: Yangi savol qo'shish
ru: Добавить новый вопрос

source: sinf
ru: класс

source: Chorak
ru: Четверть

source: chorak
ru: четверть

source: Savol matni
ru: Текст вопроса

source: Savolni kiriting...
ru: Введите вопрос...

source: Variant A
ru: Вариант A

source: A varianti...
ru: Вариант A...

source: Variant B
ru: Вариант B

source: B varianti...
ru: Вариант B...

source: Variant C
ru: Вариант C

source: C varianti...
ru: Вариант C...

source: Variant D
ru: Вариант D

source: D varianti...
ru: Вариант D...

source: To'g'ri javob
ru: Правильный ответ

source: O'zgarishlarni saqlash
ru: Сохранить изменения

source: Savolni qo'shish
ru: Добавить вопрос

source: Bekor qilish
ru: Отмена

source: Savollar boshqaruvi
ru: Управление вопросами

source: Test savollarini yaratish va boshqarish bo'limi
ru: Раздел создания и управления тестовыми вопросами

source: Ko'rsatilmoqda
ru: Показано

source: ta savol
ru: вопросов

source: sahifa
ru: страница

source: tadan
ru: из

source: Jami
ru: Всего

source: filtrlangan
ru: отфильтровано

source: Savol
ru: Вопрос

source: To'g'ri
ru: Правильно

source: Amallar
ru: Действия

source: Tahrirlash
ru: Редактировать

source: Savolni o'chirishni tasdiqlaysizmi?
ru: Вы уверены, что хотите удалить вопрос?

source: O'chirish
ru: Удалить

source: Oldingi
ru: Назад

source: Keyingi
ru: Вперед

source: Savollar topilmadi
ru: Вопросы не найдены

source: Tanlangan filtrlar bo'yicha savollar mavjud emas.
ru: По выбранным фильтрам вопросов нет.

source: Birinchi savolni qo'shish
ru: Добавить первый вопрос

source: Savollar statistikasi
ru: Статистика вопросов

source: ch
ru: ч

source: Eslatma
ru: Примечание

source: Yashil
ru: Зеленый

source: savol (yetarli)
ru: вопросов (достаточно)

source: Sariq
ru: Желтый

source: savol
ru: вопросов

source: Qizil
ru: Красный

source: dan kam savol
ru: менее 20 вопросов

source: Test natijalari
ru: Результаты тестов

source: O'quvchilarning test natijalari va statistikasi
ru: Результаты и статистика тестов учеников

source: ta natija
ru: результатов

source: Kun bo'yicha o'chirish
ru: Удалить по дате

source: Baho
ru: Оценка

source: Bu natijani o'chirishni tasdiqlaysizmi?
ru: Вы подтверждаете удаление этого результата?

source: Statistika
ru: Статистика

source: Jami testlar
ru: Всего тестов

source: A'lo baholar
ru: Отличные оценки

source: O'rtacha natija
ru: Средний результат

source: O'rtacha ball
ru: Средний балл

source: Natijalar topilmadi
ru: Результаты не найдены

source: Sanani tanlang
ru: Выберите дату

source: Diqqat! Tanlangan kundagi barcha natijalar o'chiriladi va qayta tiklanmaydi.
ru: Внимание! Все результаты за выбранную дату будут удалены безвозвратно.

source: Fanni tahrirlash
ru: Редактирование предмета

source: Yangi fan qo'shish
ru: Добавить новый предмет

source: ma'lumotlarini o'zgartirish
ru: изменение данных

source: Tizimga yangi fan kiritish
ru: Добавление нового предмета в систему

source: Fan nomi
ru: Название предмета

source: Masalan: Informatika
ru: Например: Информатика

source: Sinflar (vergul bilan)
ru: Классы (через запятую)

source: Masalan: 5,6,7,8
ru: Например: 5,6,7,8

source: Sinflarni vergul bilan ajratib yozing (bo'sh joylarsiz)
ru: Пишите классы через запятую (без пробелов)

source: Saqlash
ru: Сохранить

source: Fanlar ro'yxati
ru: Список предметов

source: Tizimdagi mavjud fanlar va ularning sinflari
ru: Доступные предметы в системе и их классы

source: Yangi fan qo'shish
ru: Добавить новый предмет

source: Sinflar
ru: Классы

source: Savollar soni
ru: Количество вопросов

source: Haqiqatan ham bu fanni o'chirmoqchimisiz? Unga bog'liq barcha ma'lumotlar tekshiriladi.
ru: Вы действительно хотите удалить этот предмет? Все связанные данные будут проверены.

source: Hozircha fanlar mavjud emas
ru: Пока нет предметов

source: Birinchi fanni qo'shish
ru: Добавить первый предмет

source: Bosh sahifa
ru: Главная

source: Dashboard
ru: Панель

source: Savollar
ru: Вопросы

source: Chiqish
ru: Выход

source: Test topshirish
ru: Сдача тестов

source: Platformasi
ru: Платформа

source: Informatika va zamonaviy texnologiyalar bo'yicha
ru: Интерактивные тесты по информатике и современным технологиям

source: Test topshirish va bilimlarni sinash uchun maxsus bo'lim.
ru: Специальный раздел для сдачи тестов и проверки знаний.

source: 20 ta savol, avtomatik natija.
ru: 20 вопросов, автоматический результат.

source: Boshlash
ru: Начать

source: O'qituvchi
ru: Учитель

source: Tizimni boshqarish, savollar kiritish va natijalarni nazorat qilish bo'limi.
ru: Раздел управления системой, ввода вопросов и контроля результатов.

source: Aqlli Tizim
ru: Умная система

source: Har bir urinishda savollar bazasidan tasodifiy 20 ta savol tanlab olinadi.
ru: В каждой попытке случайным образом выбираются 20 вопросов из базы вопросов.

source: Aniq Hisob
ru: Точный расчет

source: Test yakunida ballar va foizlar avtomatik hisoblanib, darhol ko'rsatiladi.
ru: В конце теста баллы и проценты рассчитываются автоматически и отображаются немедленно.

source: Qulay Dizayn
ru: Удобный дизайн

source: Istalgan qurilma: telefon, planshet yoki kompyuter orqali bemalol foydalaning.
ru: Свободно используйте на любом устройстве: телефоне, планшете или компьютере.

source: Test yakunlandi!
ru: Тест завершен!

source: Sizning natijalaringiz
ru: Ваши результаты

source: To'plangan ball
ru: Набранные баллы

source: Maksimal ball
ru: Максимальный балл

source: Batafsil natijalar
ru: Подробные результаты

source: Sizning javobingiz
ru: Ваш ответ

source: Javob berilmagan
ru: Ответ не дан

source: Yana test topshirish
ru: Сдать тест еще раз

source: Bilimingizni sinang
ru: Проверьте свои знания

source: Test ishlash uchun ma'lumotlaringizni kiriting
ru: Введите данные для прохождения теста

source: Ism
ru: Имя

source: Ismingiz
ru: Ваше имя

source: Familiya
ru: Фамилия

source: Familiyangiz
ru: Ваша фамилия

source: Tanlang...
ru: Выберите...

source: Sinf raqami
ru: Номер класса

source: Vaqt
ru: Время

source: Testni yakunlashga ishonchingiz komilmi?
ru: Вы уверены, что хотите завершить тест?

source: Yakunlash
ru: Завершить
